# ActualRisersNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRun..::..ActualRisersNumber Property
StairsRun Class See Also
---
The actual number of stairs risers in the stairs run.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int ActualRisersNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ActualRisersNumber As Integer
	Get
```

Visual C++
---
```text
public:
property int ActualRisersNumber {
	int get ();
}
```

# Remarks
This is a read-only value.
# See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace